tests/k6/results/cache_20260921_042951.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/mg/mailguard/tests/k6/cache.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  0m01.0s/3m00.0s

running (0m02.0s), 02/20 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 02/20 VUs  0m02.0s/3m00.0s

running (0m03.0s), 03/20 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 03/20 VUs  0m03.0s/3m00.0s

running (0m04.0s), 04/20 VUs, 6 complete and 0 interrupted iterations
default   [   2% ] 04/20 VUs  0m04.0s/3m00.0s

running (0m05.0s), 05/20 VUs, 10 complete and 0 interrupted iterations
default   [   3% ] 05/20 VUs  0m05.0s/3m00.0s

running (0m06.0s), 06/20 VUs, 15 complete and 0 interrupted iterations
default   [   3% ] 06/20 VUs  0m06.0s/3m00.0s

running (0m07.0s), 07/20 VUs, 21 complete and 0 interrupted iterations
default   [   4% ] 07/20 VUs  0m07.0s/3m00.0s

running (0m08.0s), 08/20 VUs, 28 complete and 0 interrupted iterations
default   [   4% ] 08/20 VUs  0m08.0s/3m00.0s

running (0m09.0s), 09/20 VUs, 36 complete and 0 interrupted iterations
default   [   5% ] 09/20 VUs  0m09.0s/3m00.0s

running (0m10.0s), 10/20 VUs, 45 complete and 0 interrupted iterations
default   [   6% ] 10/20 VUs  0m10.0s/3m00.0s

running (0m11.0s), 11/20 VUs, 55 complete and 0 interrupted iterations
default   [   6% ] 11/20 VUs  0m11.0s/3m00.0s

running (0m12.0s), 12/20 VUs, 66 complete and 0 interrupted iterations
default   [   7% ] 12/20 VUs  0m12.0s/3m00.0s

running (0m13.0s), 13/20 VUs, 78 complete and 0 interrupted iterations
default   [   7% ] 13/20 VUs  0m13.0s/3m00.0s

running (0m14.0s), 14/20 VUs, 91 complete and 0 interrupted iterations
default   [   8% ] 14/20 VUs  0m14.0s/3m00.0s

running (0m15.0s), 15/20 VUs, 105 complete and 0 interrupted iterations
default   [   8% ] 15/20 VUs  0m15.0s/3m00.0s

running (0m16.0s), 16/20 VUs, 120 complete and 0 interrupted iterations
default   [   9% ] 16/20 VUs  0m16.0s/3m00.0s

running (0m17.0s), 17/20 VUs, 136 complete and 0 interrupted iterations
default   [   9% ] 17/20 VUs  0m17.0s/3m00.0s

running (0m18.0s), 18/20 VUs, 153 complete and 0 interrupted iterations
default   [  10% ] 18/20 VUs  0m18.0s/3m00.0s

running (0m19.0s), 19/20 VUs, 164 complete and 0 interrupted iterations
default   [  11% ] 19/20 VUs  0m19.0s/3m00.0s

running (0m20.0s), 19/20 VUs, 183 complete and 0 interrupted iterations
default   [  11% ] 19/20 VUs  0m20.0s/3m00.0s

running (0m21.0s), 20/20 VUs, 201 complete and 0 interrupted iterations
default   [  12% ] 20/20 VUs  0m21.0s/3m00.0s

running (0m22.0s), 20/20 VUs, 221 complete and 0 interrupted iterations
default   [  12% ] 20/20 VUs  0m22.0s/3m00.0s

running (0m23.0s), 20/20 VUs, 235 complete and 0 interrupted iterations
default   [  13% ] 20/20 VUs  0m23.0s/3m00.0s

running (0m24.0s), 20/20 VUs, 253 complete and 0 interrupted iterations
default   [  13% ] 20/20 VUs  0m24.0s/3m00.0s

running (0m25.0s), 20/20 VUs, 272 complete and 0 interrupted iterations
default   [  14% ] 20/20 VUs  0m25.0s/3m00.0s

running (0m26.0s), 20/20 VUs, 291 complete and 0 interrupted iterations
default   [  14% ] 20/20 VUs  0m26.0s/3m00.0s

running (0m27.0s), 20/20 VUs, 311 complete and 0 interrupted iterations
default   [  15% ] 20/20 VUs  0m27.0s/3m00.0s

running (0m28.0s), 20/20 VUs, 331 complete and 0 interrupted iterations
default   [  16% ] 20/20 VUs  0m28.0s/3m00.0s

running (0m29.0s), 20/20 VUs, 351 complete and 0 interrupted iterations
default   [  16% ] 20/20 VUs  0m29.0s/3m00.0s

running (0m30.0s), 20/20 VUs, 371 complete and 0 interrupted iterations
default   [  17% ] 20/20 VUs  0m30.0s/3m00.0s

running (0m31.0s), 20/20 VUs, 391 complete and 0 interrupted iterations
default   [  17% ] 20/20 VUs  0m31.0s/3m00.0s

running (0m32.0s), 20/20 VUs, 411 complete and 0 interrupted iterations
default   [  18% ] 20/20 VUs  0m32.0s/3m00.0s

running (0m33.0s), 20/20 VUs, 431 complete and 0 interrupted iterations
default   [  18% ] 20/20 VUs  0m33.0s/3m00.0s

running (0m34.0s), 20/20 VUs, 451 complete and 0 interrupted iterations
default   [  19% ] 20/20 VUs  0m34.0s/3m00.0s

running (0m35.0s), 20/20 VUs, 470 complete and 0 interrupted iterations
default   [  19% ] 20/20 VUs  0m35.0s/3m00.0s

running (0m36.0s), 20/20 VUs, 490 complete and 0 interrupted iterations
default   [  20% ] 20/20 VUs  0m36.0s/3m00.0s

running (0m37.0s), 20/20 VUs, 510 complete and 0 interrupted iterations
default   [  21% ] 20/20 VUs  0m37.0s/3m00.0s

running (0m38.0s), 20/20 VUs, 530 complete and 0 interrupted iterations
default   [  21% ] 20/20 VUs  0m38.0s/3m00.0s

running (0m39.0s), 20/20 VUs, 550 complete and 0 interrupted iterations
default   [  22% ] 20/20 VUs  0m39.0s/3m00.0s

running (0m40.0s), 20/20 VUs, 570 complete and 0 interrupted iterations
default   [  22% ] 20/20 VUs  0m40.0s/3m00.0s

running (0m41.0s), 20/20 VUs, 590 complete and 0 interrupted iterations
default   [  23% ] 20/20 VUs  0m41.0s/3m00.0s

running (0m42.0s), 20/20 VUs, 610 complete and 0 interrupted iterations
default   [  23% ] 20/20 VUs  0m42.0s/3m00.0s

running (0m43.0s), 20/20 VUs, 630 complete and 0 interrupted iterations
default   [  24% ] 20/20 VUs  0m43.0s/3m00.0s

running (0m44.0s), 20/20 VUs, 650 complete and 0 interrupted iterations
default   [  24% ] 20/20 VUs  0m44.0s/3m00.0s

running (0m45.0s), 20/20 VUs, 670 complete and 0 interrupted iterations
default   [  25% ] 20/20 VUs  0m45.0s/3m00.0s

running (0m46.0s), 20/20 VUs, 690 complete and 0 interrupted iterations
default   [  26% ] 20/20 VUs  0m46.0s/3m00.0s

running (0m47.0s), 20/20 VUs, 710 complete and 0 interrupted iterations
default   [  26% ] 20/20 VUs  0m47.0s/3m00.0s

running (0m48.0s), 20/20 VUs, 730 complete and 0 interrupted iterations
default   [  27% ] 20/20 VUs  0m48.0s/3m00.0s

running (0m49.0s), 20/20 VUs, 748 complete and 0 interrupted iterations
default   [  27% ] 20/20 VUs  0m49.0s/3m00.0s

running (0m50.0s), 20/20 VUs, 766 complete and 0 interrupted iterations
default   [  28% ] 20/20 VUs  0m50.0s/3m00.0s

running (0m51.0s), 20/20 VUs, 786 complete and 0 interrupted iterations
default   [  28% ] 20/20 VUs  0m51.0s/3m00.0s

running (0m52.0s), 20/20 VUs, 801 complete and 0 interrupted iterations
default   [  29% ] 20/20 VUs  0m52.0s/3m00.0s

running (0m53.0s), 20/20 VUs, 821 complete and 0 interrupted iterations
default   [  29% ] 20/20 VUs  0m53.0s/3m00.0s

running (0m54.0s), 20/20 VUs, 841 complete and 0 interrupted iterations
default   [  30% ] 20/20 VUs  0m54.0s/3m00.0s

running (0m55.0s), 20/20 VUs, 860 complete and 0 interrupted iterations
default   [  31% ] 20/20 VUs  0m55.0s/3m00.0s

running (0m56.0s), 20/20 VUs, 879 complete and 0 interrupted iterations
default   [  31% ] 20/20 VUs  0m56.0s/3m00.0s

running (0m57.0s), 20/20 VUs, 898 complete and 0 interrupted iterations
default   [  32% ] 20/20 VUs  0m57.0s/3m00.0s

running (0m58.0s), 20/20 VUs, 917 complete and 0 interrupted iterations
default   [  32% ] 20/20 VUs  0m58.0s/3m00.0s

running (0m59.0s), 20/20 VUs, 937 complete and 0 interrupted iterations
default   [  33% ] 20/20 VUs  0m59.0s/3m00.0s

running (1m00.0s), 20/20 VUs, 957 complete and 0 interrupted iterations
default   [  33% ] 20/20 VUs  1m00.0s/3m00.0s

running (1m01.0s), 20/20 VUs, 977 complete and 0 interrupted iterations
default   [  34% ] 20/20 VUs  1m01.0s/3m00.0s

running (1m02.0s), 20/20 VUs, 996 complete and 0 interrupted iterations
default   [  34% ] 20/20 VUs  1m02.0s/3m00.0s

running (1m03.0s), 20/20 VUs, 1016 complete and 0 interrupted iterations
default   [  35% ] 20/20 VUs  1m03.0s/3m00.0s

running (1m04.0s), 20/20 VUs, 1035 complete and 0 interrupted iterations
default   [  36% ] 20/20 VUs  1m04.0s/3m00.0s

running (1m05.0s), 20/20 VUs, 1055 complete and 0 interrupted iterations
default   [  36% ] 20/20 VUs  1m05.0s/3m00.0s

running (1m06.0s), 20/20 VUs, 1075 complete and 0 interrupted iterations
default   [  37% ] 20/20 VUs  1m06.0s/3m00.0s

running (1m07.0s), 20/20 VUs, 1095 complete and 0 interrupted iterations
default   [  37% ] 20/20 VUs  1m07.0s/3m00.0s

running (1m08.0s), 20/20 VUs, 1115 complete and 0 interrupted iterations
default   [  38% ] 20/20 VUs  1m08.0s/3m00.0s

running (1m09.0s), 20/20 VUs, 1135 complete and 0 interrupted iterations
default   [  38% ] 20/20 VUs  1m09.0s/3m00.0s

running (1m10.0s), 20/20 VUs, 1155 complete and 0 interrupted iterations
default   [  39% ] 20/20 VUs  1m10.0s/3m00.0s

running (1m11.0s), 20/20 VUs, 1173 complete and 0 interrupted iterations
default   [  39% ] 20/20 VUs  1m11.0s/3m00.0s

running (1m12.0s), 20/20 VUs, 1193 complete and 0 interrupted iterations
default   [  40% ] 20/20 VUs  1m12.0s/3m00.0s

running (1m13.0s), 20/20 VUs, 1212 complete and 0 interrupted iterations
default   [  41% ] 20/20 VUs  1m13.0s/3m00.0s

running (1m14.0s), 20/20 VUs, 1232 complete and 0 interrupted iterations
default   [  41% ] 20/20 VUs  1m14.0s/3m00.0s

running (1m15.0s), 20/20 VUs, 1251 complete and 0 interrupted iterations
default   [  42% ] 20/20 VUs  1m15.0s/3m00.0s

running (1m16.0s), 20/20 VUs, 1271 complete and 0 interrupted iterations
default   [  42% ] 20/20 VUs  1m16.0s/3m00.0s

running (1m17.0s), 20/20 VUs, 1291 complete and 0 interrupted iterations
default   [  43% ] 20/20 VUs  1m17.0s/3m00.0s

running (1m18.0s), 20/20 VUs, 1311 complete and 0 interrupted iterations
default   [  43% ] 20/20 VUs  1m18.0s/3m00.0s

running (1m19.0s), 20/20 VUs, 1331 complete and 0 interrupted iterations
default   [  44% ] 20/20 VUs  1m19.0s/3m00.0s

running (1m20.0s), 20/20 VUs, 1351 complete and 0 interrupted iterations
default   [  44% ] 20/20 VUs  1m20.0s/3m00.0s

running (1m21.0s), 20/20 VUs, 1371 complete and 0 interrupted iterations
default   [  45% ] 20/20 VUs  1m21.0s/3m00.0s

running (1m22.0s), 20/20 VUs, 1391 complete and 0 interrupted iterations
default   [  46% ] 20/20 VUs  1m22.0s/3m00.0s

running (1m23.0s), 20/20 VUs, 1407 complete and 0 interrupted iterations
default   [  46% ] 20/20 VUs  1m23.0s/3m00.0s

running (1m24.0s), 20/20 VUs, 1425 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  1m24.0s/3m00.0s

running (1m25.0s), 20/20 VUs, 1445 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  1m25.0s/3m00.0s

running (1m26.0s), 20/20 VUs, 1465 complete and 0 interrupted iterations
default   [  48% ] 20/20 VUs  1m26.0s/3m00.0s

running (1m27.0s), 20/20 VUs, 1485 complete and 0 interrupted iterations
default   [  48% ] 20/20 VUs  1m27.0s/3m00.0s

running (1m28.0s), 20/20 VUs, 1504 complete and 0 interrupted iterations
default   [  49% ] 20/20 VUs  1m28.0s/3m00.0s

running (1m29.0s), 20/20 VUs, 1524 complete and 0 interrupted iterations
default   [  49% ] 20/20 VUs  1m29.0s/3m00.0s

running (1m30.0s), 20/20 VUs, 1544 complete and 0 interrupted iterations
default   [  50% ] 20/20 VUs  1m30.0s/3m00.0s

running (1m31.0s), 20/20 VUs, 1564 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  1m31.0s/3m00.0s

running (1m32.0s), 20/20 VUs, 1584 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  1m32.0s/3m00.0s

running (1m33.0s), 20/20 VUs, 1604 complete and 0 interrupted iterations
default   [  52% ] 20/20 VUs  1m33.0s/3m00.0s

running (1m34.0s), 20/20 VUs, 1620 complete and 0 interrupted iterations
default   [  52% ] 20/20 VUs  1m34.0s/3m00.0s

running (1m35.0s), 20/20 VUs, 1640 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  1m35.0s/3m00.0s

running (1m36.0s), 20/20 VUs, 1659 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  1m36.0s/3m00.0s

running (1m37.0s), 20/20 VUs, 1678 complete and 0 interrupted iterations
default   [  54% ] 20/20 VUs  1m37.0s/3m00.0s

running (1m38.0s), 20/20 VUs, 1698 complete and 0 interrupted iterations
default   [  54% ] 20/20 VUs  1m38.0s/3m00.0s

running (1m39.0s), 20/20 VUs, 1717 complete and 0 interrupted iterations
default   [  55% ] 20/20 VUs  1m39.0s/3m00.0s

running (1m40.0s), 20/20 VUs, 1737 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  1m40.0s/3m00.0s

running (1m41.0s), 20/20 VUs, 1757 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  1m41.0s/3m00.0s

running (1m42.0s), 20/20 VUs, 1777 complete and 0 interrupted iterations
default   [  57% ] 20/20 VUs  1m42.0s/3m00.0s

running (1m43.0s), 20/20 VUs, 1797 complete and 0 interrupted iterations
default   [  57% ] 20/20 VUs  1m43.0s/3m00.0s

running (1m44.0s), 20/20 VUs, 1817 complete and 0 interrupted iterations
default   [  58% ] 20/20 VUs  1m44.0s/3m00.0s

running (1m45.0s), 20/20 VUs, 1837 complete and 0 interrupted iterations
default   [  58% ] 20/20 VUs  1m45.0s/3m00.0s

running (1m46.0s), 20/20 VUs, 1857 complete and 0 interrupted iterations
default   [  59% ] 20/20 VUs  1m46.0s/3m00.0s

running (1m47.0s), 20/20 VUs, 1876 complete and 0 interrupted iterations
default   [  59% ] 20/20 VUs  1m47.0s/3m00.0s

running (1m48.0s), 20/20 VUs, 1895 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  1m48.0s/3m00.0s

running (1m49.0s), 20/20 VUs, 1915 complete and 0 interrupted iterations
default   [  61% ] 20/20 VUs  1m49.0s/3m00.0s

running (1m50.0s), 20/20 VUs, 1935 complete and 0 interrupted iterations
default   [  61% ] 20/20 VUs  1m50.0s/3m00.0s

running (1m51.0s), 20/20 VUs, 1955 complete and 0 interrupted iterations
default   [  62% ] 20/20 VUs  1m51.0s/3m00.0s

running (1m52.0s), 20/20 VUs, 1975 complete and 0 interrupted iterations
default   [  62% ] 20/20 VUs  1m52.0s/3m00.0s

running (1m53.0s), 20/20 VUs, 1995 complete and 0 interrupted iterations
default   [  63% ] 20/20 VUs  1m53.0s/3m00.0s

running (1m54.0s), 20/20 VUs, 2014 complete and 0 interrupted iterations
default   [  63% ] 20/20 VUs  1m54.0s/3m00.0s

running (1m55.0s), 20/20 VUs, 2033 complete and 0 interrupted iterations
default   [  64% ] 20/20 VUs  1m55.0s/3m00.0s

running (1m56.0s), 20/20 VUs, 2053 complete and 0 interrupted iterations
default   [  64% ] 20/20 VUs  1m56.0s/3m00.0s

running (1m57.0s), 20/20 VUs, 2073 complete and 0 interrupted iterations
default   [  65% ] 20/20 VUs  1m57.0s/3m00.0s

running (1m58.0s), 20/20 VUs, 2089 complete and 0 interrupted iterations
default   [  66% ] 20/20 VUs  1m58.0s/3m00.0s

running (1m59.0s), 20/20 VUs, 2109 complete and 0 interrupted iterations
default   [  66% ] 20/20 VUs  1m59.0s/3m00.0s

running (2m00.0s), 20/20 VUs, 2127 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  2m00.0s/3m00.0s

running (2m01.0s), 20/20 VUs, 2146 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  2m01.0s/3m00.0s

running (2m02.0s), 20/20 VUs, 2165 complete and 0 interrupted iterations
default   [  68% ] 20/20 VUs  2m02.0s/3m00.0s

running (2m03.0s), 20/20 VUs, 2185 complete and 0 interrupted iterations
default   [  68% ] 20/20 VUs  2m03.0s/3m00.0s

running (2m04.0s), 20/20 VUs, 2205 complete and 0 interrupted iterations
default   [  69% ] 20/20 VUs  2m04.0s/3m00.0s

running (2m05.0s), 20/20 VUs, 2225 complete and 0 interrupted iterations
default   [  69% ] 20/20 VUs  2m05.0s/3m00.0s

running (2m06.0s), 20/20 VUs, 2245 complete and 0 interrupted iterations
default   [  70% ] 20/20 VUs  2m06.0s/3m00.0s

running (2m07.0s), 20/20 VUs, 2265 complete and 0 interrupted iterations
default   [  71% ] 20/20 VUs  2m07.0s/3m00.0s

running (2m08.0s), 20/20 VUs, 2285 complete and 0 interrupted iterations
default   [  71% ] 20/20 VUs  2m08.0s/3m00.0s

running (2m09.0s), 20/20 VUs, 2302 complete and 0 interrupted iterations
default   [  72% ] 20/20 VUs  2m09.0s/3m00.0s

running (2m10.0s), 20/20 VUs, 2321 complete and 0 interrupted iterations
default   [  72% ] 20/20 VUs  2m10.0s/3m00.0s

running (2m11.0s), 20/20 VUs, 2341 complete and 0 interrupted iterations
default   [  73% ] 20/20 VUs  2m11.0s/3m00.0s

running (2m12.0s), 20/20 VUs, 2361 complete and 0 interrupted iterations
default   [  73% ] 20/20 VUs  2m12.0s/3m00.0s

running (2m13.0s), 20/20 VUs, 2381 complete and 0 interrupted iterations
default   [  74% ] 20/20 VUs  2m13.0s/3m00.0s

running (2m14.0s), 20/20 VUs, 2400 complete and 0 interrupted iterations
default   [  74% ] 20/20 VUs  2m14.0s/3m00.0s

running (2m15.0s), 20/20 VUs, 2420 complete and 0 interrupted iterations
default   [  75% ] 20/20 VUs  2m15.0s/3m00.0s

running (2m16.0s), 20/20 VUs, 2440 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  2m16.0s/3m00.0s

running (2m17.0s), 20/20 VUs, 2459 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  2m17.0s/3m00.0s

running (2m18.0s), 20/20 VUs, 2479 complete and 0 interrupted iterations
default   [  77% ] 20/20 VUs  2m18.0s/3m00.0s

running (2m19.0s), 20/20 VUs, 2499 complete and 0 interrupted iterations
default   [  77% ] 20/20 VUs  2m19.0s/3m00.0s

running (2m20.0s), 20/20 VUs, 2519 complete and 0 interrupted iterations
default   [  78% ] 20/20 VUs  2m20.0s/3m00.0s

running (2m21.0s), 20/20 VUs, 2539 complete and 0 interrupted iterations
default   [  78% ] 20/20 VUs  2m21.0s/3m00.0s

running (2m22.0s), 20/20 VUs, 2559 complete and 0 interrupted iterations
default   [  79% ] 20/20 VUs  2m22.0s/3m00.0s

running (2m23.0s), 20/20 VUs, 2578 complete and 0 interrupted iterations
default   [  79% ] 20/20 VUs  2m23.0s/3m00.0s

running (2m24.0s), 20/20 VUs, 2598 complete and 0 interrupted iterations
default   [  80% ] 20/20 VUs  2m24.0s/3m00.0s

running (2m25.0s), 20/20 VUs, 2617 complete and 0 interrupted iterations
default   [  81% ] 20/20 VUs  2m25.0s/3m00.0s

running (2m26.0s), 20/20 VUs, 2637 complete and 0 interrupted iterations
default   [  81% ] 20/20 VUs  2m26.0s/3m00.0s

running (2m27.0s), 20/20 VUs, 2657 complete and 0 interrupted iterations
default   [  82% ] 20/20 VUs  2m27.0s/3m00.0s

running (2m28.0s), 20/20 VUs, 2677 complete and 0 interrupted iterations
default   [  82% ] 20/20 VUs  2m28.0s/3m00.0s

running (2m29.0s), 20/20 VUs, 2697 complete and 0 interrupted iterations
default   [  83% ] 20/20 VUs  2m29.0s/3m00.0s

running (2m30.0s), 20/20 VUs, 2717 complete and 0 interrupted iterations
default   [  83% ] 20/20 VUs  2m30.0s/3m00.0s

running (2m31.0s), 20/20 VUs, 2737 complete and 0 interrupted iterations
default   [  84% ] 20/20 VUs  2m31.0s/3m00.0s

running (2m32.0s), 20/20 VUs, 2755 complete and 0 interrupted iterations
default   [  84% ] 20/20 VUs  2m32.0s/3m00.0s

running (2m33.0s), 20/20 VUs, 2774 complete and 0 interrupted iterations
default   [  85% ] 20/20 VUs  2m33.0s/3m00.0s

running (2m34.0s), 20/20 VUs, 2792 complete and 0 interrupted iterations
default   [  86% ] 20/20 VUs  2m34.0s/3m00.0s

running (2m35.0s), 20/20 VUs, 2812 complete and 0 interrupted iterations
default   [  86% ] 20/20 VUs  2m35.0s/3m00.0s

running (2m36.0s), 20/20 VUs, 2832 complete and 0 interrupted iterations
default   [  87% ] 20/20 VUs  2m36.0s/3m00.0s

running (2m37.0s), 20/20 VUs, 2851 complete and 0 interrupted iterations
default   [  87% ] 20/20 VUs  2m37.0s/3m00.0s

running (2m38.0s), 20/20 VUs, 2871 complete and 0 interrupted iterations
default   [  88% ] 20/20 VUs  2m38.0s/3m00.0s

running (2m39.0s), 20/20 VUs, 2891 complete and 0 interrupted iterations
default   [  88% ] 20/20 VUs  2m39.0s/3m00.0s

running (2m40.0s), 20/20 VUs, 2910 complete and 0 interrupted iterations
default   [  89% ] 20/20 VUs  2m40.0s/3m00.0s

running (2m41.0s), 20/20 VUs, 2930 complete and 0 interrupted iterations
default   [  89% ] 20/20 VUs  2m41.0s/3m00.0s

running (2m42.0s), 19/20 VUs, 2950 complete and 0 interrupted iterations
default   [  90% ] 19/20 VUs  2m42.0s/3m00.0s

running (2m43.0s), 18/20 VUs, 2969 complete and 0 interrupted iterations
default   [  91% ] 18/20 VUs  2m43.0s/3m00.0s

running (2m44.0s), 17/20 VUs, 2987 complete and 0 interrupted iterations
default   [  91% ] 17/20 VUs  2m44.0s/3m00.0s

running (2m45.0s), 16/20 VUs, 3004 complete and 0 interrupted iterations
default   [  92% ] 16/20 VUs  2m45.0s/3m00.0s

running (2m46.0s), 15/20 VUs, 3020 complete and 0 interrupted iterations
default   [  92% ] 15/20 VUs  2m46.0s/3m00.0s

running (2m47.0s), 15/20 VUs, 3031 complete and 0 interrupted iterations
default   [  93% ] 15/20 VUs  2m47.0s/3m00.0s

running (2m48.0s), 13/20 VUs, 3046 complete and 0 interrupted iterations
default   [  93% ] 13/20 VUs  2m48.0s/3m00.0s

running (2m49.0s), 13/20 VUs, 3058 complete and 0 interrupted iterations
default   [  94% ] 13/20 VUs  2m49.0s/3m00.0s

running (2m50.0s), 11/20 VUs, 3071 complete and 0 interrupted iterations
default   [  94% ] 11/20 VUs  2m50.0s/3m00.0s

running (2m51.0s), 10/20 VUs, 3082 complete and 0 interrupted iterations
default   [  95% ] 10/20 VUs  2m51.0s/3m00.0s

running (2m52.0s), 09/20 VUs, 3092 complete and 0 interrupted iterations
default   [  96% ] 09/20 VUs  2m52.0s/3m00.0s

running (2m53.0s), 08/20 VUs, 3101 complete and 0 interrupted iterations
default   [  96% ] 08/20 VUs  2m53.0s/3m00.0s

running (2m54.0s), 07/20 VUs, 3109 complete and 0 interrupted iterations
default   [  97% ] 07/20 VUs  2m54.0s/3m00.0s

running (2m55.0s), 06/20 VUs, 3116 complete and 0 interrupted iterations
default   [  97% ] 06/20 VUs  2m55.0s/3m00.0s

running (2m56.0s), 05/20 VUs, 3122 complete and 0 interrupted iterations
default   [  98% ] 05/20 VUs  2m56.0s/3m00.0s

running (2m57.0s), 04/20 VUs, 3127 complete and 0 interrupted iterations
default   [  98% ] 04/20 VUs  2m57.0s/3m00.0s

running (2m58.0s), 03/20 VUs, 3131 complete and 0 interrupted iterations
default   [  99% ] 03/20 VUs  2m58.0s/3m00.0s

running (2m59.0s), 02/20 VUs, 3134 complete and 0 interrupted iterations
default   [  99% ] 02/20 VUs  2m59.0s/3m00.0s

running (3m00.0s), 01/20 VUs, 3136 complete and 0 interrupted iterations
default   [ 100% ] 01/20 VUs  3m00.0s/3m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<200' p(95)=63.68ms

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 3137    17.411086/s
    checks_succeeded...: 100.00% 3137 out of 3137
    checks_failed......: 0.00%   0 out of 3137

    ✓ status 200

    HTTP
    http_req_duration..............: avg=24.72ms min=2.97ms med=18.99ms max=144.92ms p(90)=49.71ms p(95)=63.68ms p(99)=91.46ms
      { expected_response:true }...: avg=24.72ms min=2.97ms med=18.99ms max=144.92ms p(90)=49.71ms p(95)=63.68ms p(99)=91.46ms
    http_req_failed................: 0.00%  0 out of 3137
    http_reqs......................: 3137   17.411086/s

    EXECUTION
    iteration_duration.............: avg=1.02s   min=1s     med=1.02s   max=1.14s    p(90)=1.05s   p(95)=1.06s   p(99)=1.09s  
    iterations.....................: 3137   17.411086/s
    vus............................: 1      min=1         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 6.0 MB 34 kB/s
    data_sent......................: 731 kB 4.1 kB/s



running (3m00.2s), 00/20 VUs, 3137 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  3m0s
====================================================================
 SLI mesurés côté serveur (Prometheus) — scénario cache
====================================================================
 fenêtre          : 04:29:51 -> 04:32:52 (181 s)
 requêtes /verify : 3300
 latence P95      : 50 ms
 latence P99      : 91 ms
 erreurs 5xx      : 0.000 %  (disponibilité 100.000 %)
 cache hit ratio  : 68.5 %  (2221 hits / 3243)
 pods API         : 4 prêts, 4 scrapés (une série par pod)
====================================================================